MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TFCGFL/mcu.h
typedef struct st_flash {
	char           wk00[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FLWE : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char FLWE : 2;
#endif
	} BIT;
	} FWEPROR;
	char           wk0[7794397];
	unsigned long  UIDR0;
	char           wk1[108];
	unsigned long  UIDR1;
	unsigned long  UIDR2;
	char           wk2[11812];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char DFAE : 1;
			unsigned char CMDLK : 1;
			unsigned char  : 2;
			unsigned char CFAE : 1;
#else
			unsigned char CFAE : 1;
			unsigned char  : 2;
			unsigned char CMDLK : 1;
			unsigned char DFAE : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} FASTAT;
	char           wk3[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 3;
			unsigned char DFAEIE : 1;
			unsigned char CMDLKIE : 1;
			unsigned char  : 2;
			unsigned char CFAEIE : 1;
#else
			unsigned char CFAEIE : 1;
			unsigned char  : 2;
			unsigned char CMDLKIE : 1;
			unsigned char DFAEIE : 1;
			unsigned char  : 3;
#endif
	} BIT;
	} FAEINT;
	char           wk4[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FRDYIE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char FRDYIE : 1;
#endif
	} BIT;
	} FRDYIE;
	char           wk5[23];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FSADDR : 32;
#else
			unsigned long FSADDR : 32;
#endif
	} BIT;
	} FSADDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FEADDR : 32;
#else
			unsigned long FEADDR : 32;
#endif
	} BIT;
	} FEADDR;
	char           wk6[72];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 6;
			unsigned long FLWEERR : 1;
			unsigned long  : 1;
			unsigned long PRGSPD : 1;
			unsigned long ERSSPD : 1;
			unsigned long DBFULL : 1;
			unsigned long SUSRDY : 1;
			unsigned long PRGERR : 1;
			unsigned long ERSERR : 1;
			unsigned long ILGLERR : 1;
			unsigned long FRDY : 1;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long FRDY : 1;
			unsigned long ILGLERR : 1;
			unsigned long ERSERR : 1;
			unsigned long PRGERR : 1;
			unsigned long SUSRDY : 1;
			unsigned long DBFULL : 1;
			unsigned long ERSSPD : 1;
			unsigned long PRGSPD : 1;
			unsigned long  : 1;
			unsigned long FLWEERR : 1;
			unsigned long  : 6;
#endif
	} BIT;
	} FSTATR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FENTRYC : 1;
			unsigned short  : 6;
			unsigned short FENTRYD : 1;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short FENTRYD : 1;
			unsigned short  : 6;
			unsigned short FENTRYC : 1;
#endif
	} BIT;
	} FENTRYR;
	char           wk7[6];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SUINIT : 1;
			unsigned short  : 7;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short  : 7;
			unsigned short SUINIT : 1;
#endif
	} BIT;
	} FSUINITR;
	char           wk8[18];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PCMDR : 8;
			unsigned short CMDR : 8;
#else
			unsigned short CMDR : 8;
			unsigned short PCMDR : 8;
#endif
	} BIT;
	} FCMDR;
	char           wk9[30];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PEERRST : 8;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short PEERRST : 8;
#endif
	} BIT;
	} FPESTAT;
	char           wk10[14];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCDIR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char BCDIR : 1;
#endif
	} BIT;
	} FBCCNT;
	char           wk11[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BCST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char BCST : 1;
#endif
	} BIT;
	} FBCSTAT;
	char           wk12[3];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PSADR : 19;
			unsigned long  : 13;
#else
			unsigned long  : 13;
			unsigned long PSADR : 19;
#endif
	} BIT;
	} FPSADDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FAWS : 13;
			unsigned long  : 2;
			unsigned long FSPR : 1;
			unsigned long FAWE : 13;
			unsigned long  : 2;
			unsigned long BTFLG : 1;
#else
			unsigned long BTFLG : 1;
			unsigned long  : 2;
			unsigned long FAWE : 13;
			unsigned long FSPR : 1;
			unsigned long  : 2;
			unsigned long FAWS : 13;
#endif
	} BIT;
	} FAWMON;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short ESUSPMD : 1;
			unsigned short  : 15;
#else
			unsigned short  : 15;
			unsigned short ESUSPMD : 1;
#endif
	} BIT;
	} FCPSR;
	char           wk13[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PCKA : 8;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short PCKA : 8;
#endif
	} BIT;
	} FPCKAR;
	char           wk14[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SAS : 2;
			unsigned short  : 6;
			unsigned short KEY : 8;
#else
			unsigned short KEY : 8;
			unsigned short  : 6;
			unsigned short SAS : 2;
#endif
	} BIT;
	} FSUACR;
} st_flash_t;

typedef struct st_gptw {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long UF : 1;
			unsigned long VF : 1;
			unsigned long WF : 1;
			unsigned long  : 1;
			unsigned long U : 1;
			unsigned long V : 1;
			unsigned long W : 1;
			unsigned long  : 1;
			unsigned long EN : 1;
			unsigned long  : 7;
			unsigned long FB : 1;
			unsigned long P : 1;
			unsigned long N : 1;
			unsigned long INV : 1;
			unsigned long RV : 1;
			unsigned long ALIGN : 1;
			unsigned long  : 2;
			unsigned long GRP : 2;
			unsigned long GODF : 1;
			unsigned long  : 2;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long  : 2;
			unsigned long GODF : 1;
			unsigned long GRP : 2;
			unsigned long  : 2;
			unsigned long ALIGN : 1;
			unsigned long RV : 1;
			unsigned long INV : 1;
			unsigned long N : 1;
			unsigned long P : 1;
			unsigned long FB : 1;
			unsigned long  : 7;
			unsigned long EN : 1;
			unsigned long  : 1;
			unsigned long W : 1;
			unsigned long V : 1;
			unsigned long U : 1;
			unsigned long  : 1;
			unsigned long WF : 1;
			unsigned long VF : 1;
			unsigned long UF : 1;
#endif
	} BIT;
	} OPSCR;
} st_gptw_t;

typedef struct st_gptw0 {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WP : 1;
			unsigned long STRWP : 1;
			unsigned long STPWP : 1;
			unsigned long CLRWP : 1;
			unsigned long CMNWP : 1;
			unsigned long  : 3;
			unsigned long PRKEY : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long PRKEY : 8;
			unsigned long  : 3;
			unsigned long CMNWP : 1;
			unsigned long CLRWP : 1;
			unsigned long STPWP : 1;
			unsigned long STRWP : 1;
			unsigned long WP : 1;
#endif
	} BIT;
	} GTWP;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CSTRT0 : 1;
			unsigned long CSTRT1 : 1;
			unsigned long CSTRT2 : 1;
			unsigned long CSTRT3 : 1;
			unsigned long CSTRT4 : 1;
			unsigned long CSTRT5 : 1;
			unsigned long CSTRT6 : 1;
			unsigned long CSTRT7 : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long CSTRT7 : 1;
			unsigned long CSTRT6 : 1;
			unsigned long CSTRT5 : 1;
			unsigned long CSTRT4 : 1;
			unsigned long CSTRT3 : 1;
			unsigned long CSTRT2 : 1;
			unsigned long CSTRT1 : 1;
			unsigned long CSTRT0 : 1;
#endif
	} BIT;
	} GTSTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CSTOP0 : 1;
			unsigned long CSTOP1 : 1;
			unsigned long CSTOP2 : 1;
			unsigned long CSTOP3 : 1;
			unsigned long CSTOP4 : 1;
			unsigned long CSTOP5 : 1;
			unsigned long CSTOP6 : 1;
			unsigned long CSTOP7 : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long CSTOP7 : 1;
			unsigned long CSTOP6 : 1;
			unsigned long CSTOP5 : 1;
			unsigned long CSTOP4 : 1;
			unsigned long CSTOP3 : 1;
			unsigned long CSTOP2 : 1;
			unsigned long CSTOP1 : 1;
			unsigned long CSTOP0 : 1;
#endif
	} BIT;
	} GTSTP;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CCLR0 : 1;
			unsigned long CCLR1 : 1;
			unsigned long CCLR2 : 1;
			unsigned long CCLR3 : 1;
			unsigned long CCLR4 : 1;
			unsigned long CCLR5 : 1;
			unsigned long CCLR6 : 1;
			unsigned long CCLR7 : 1;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long CCLR7 : 1;
			unsigned long CCLR6 : 1;
			unsigned long CCLR5 : 1;
			unsigned long CCLR4 : 1;
			unsigned long CCLR3 : 1;
			unsigned long CCLR2 : 1;
			unsigned long CCLR1 : 1;
			unsigned long CCLR0 : 1;
#endif
	} BIT;
	} GTCLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SSGTRGAR : 1;
			unsigned long SSGTRGAF : 1;
			unsigned long SSGTRGBR : 1;
			unsigned long SSGTRGBF : 1;
			unsigned long SSGTRGCR : 1;
			unsigned long SSGTRGCF : 1;
			unsigned long SSGTRGDR : 1;
			unsigned long SSGTRGDF : 1;
			unsigned long SSCARBL : 1;
			unsigned long SSCARBH : 1;
			unsigned long SSCAFBL : 1;
			unsigned long SSCAFBH : 1;
			unsigned long SSCBRAL : 1;
			unsigned long SSCBRAH : 1;
			unsigned long SSCBFAL : 1;
			unsigned long SSCBFAH : 1;
			unsigned long SSELCA : 1;
			unsigned long SSELCB : 1;
			unsigned long SSELCC : 1;
			unsigned long SSELCD : 1;
			unsigned long SSELCE : 1;
			unsigned long SSELCF : 1;
			unsigned long SSELCG : 1;
			unsigned long SSELCH : 1;
			unsigned long  : 7;
			unsigned long CSTRT : 1;
#else
			unsigned long CSTRT : 1;
			unsigned long  : 7;
			unsigned long SSELCH : 1;
			unsigned long SSELCG : 1;
			unsigned long SSELCF : 1;
			unsigned long SSELCE : 1;
			unsigned long SSELCD : 1;
			unsigned long SSELCC : 1;
			unsigned long SSELCB : 1;
			unsigned long SSELCA : 1;
			unsigned long SSCBFAH : 1;
			unsigned long SSCBFAL : 1;
			unsigned long SSCBRAH : 1;
			unsigned long SSCBRAL : 1;
			unsigned long SSCAFBH : 1;
			unsigned long SSCAFBL : 1;
			unsigned long SSCARBH : 1;
			unsigned long SSCARBL : 1;
			unsigned long SSGTRGDF : 1;
			unsigned long SSGTRGDR : 1;
			unsigned long SSGTRGCF : 1;
			unsigned long SSGTRGCR : 1;
			unsigned long SSGTRGBF : 1;
			unsigned long SSGTRGBR : 1;
			unsigned long SSGTRGAF : 1;
			unsigned long SSGTRGAR : 1;
#endif
	} BIT;
	} GTSSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PSGTRGAR : 1;
			unsigned long PSGTRGAF : 1;
			unsigned long PSGTRGBR : 1;
			unsigned long PSGTRGBF : 1;
			unsigned long PSGTRGCR : 1;
			unsigned long PSGTRGCF : 1;
			unsigned long PSGTRGDR : 1;
			unsigned long PSGTRGDF : 1;
			unsigned long PSCARBL : 1;
			unsigned long PSCARBH : 1;
			unsigned long PSCAFBL : 1;
			unsigned long PSCAFBH : 1;
			unsigned long PSCBRAL : 1;
			unsigned long PSCBRAH : 1;
			unsigned long PSCBFAL : 1;
			unsigned long PSCBFAH : 1;
			unsigned long PSELCA : 1;
			unsigned long PSELCB : 1;
			unsigned long PSELCC : 1;
			unsigned long PSELCD : 1;
			unsigned long PSELCE : 1;
			unsigned long PSELCF : 1;
			unsigned long PSELCG : 1;
			unsigned long PSELCH : 1;
			unsigned long  : 7;
			unsigned long CSTOP : 1;
#else
			unsigned long CSTOP : 1;
			unsigned long  : 7;
			unsigned long PSELCH : 1;
			unsigned long PSELCG : 1;
			unsigned long PSELCF : 1;
			unsigned long PSELCE : 1;
			unsigned long PSELCD : 1;
			unsigned long PSELCC : 1;
			unsigned long PSELCB : 1;
			unsigned long PSELCA : 1;
			unsigned long PSCBFAH : 1;
			unsigned long PSCBFAL : 1;
			unsigned long PSCBRAH : 1;
			unsigned long PSCBRAL : 1;
			unsigned long PSCAFBH : 1;
			unsigned long PSCAFBL : 1;
			unsigned long PSCARBH : 1;
			unsigned long PSCARBL : 1;
			unsigned long PSGTRGDF : 1;
			unsigned long PSGTRGDR : 1;
			unsigned long PSGTRGCF : 1;
			unsigned long PSGTRGCR : 1;
			unsigned long PSGTRGBF : 1;
			unsigned long PSGTRGBR : 1;
			unsigned long PSGTRGAF : 1;
			unsigned long PSGTRGAR : 1;
#endif
	} BIT;
	} GTPSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CSGTRGAR : 1;
			unsigned long CSGTRGAF : 1;
			unsigned long CSGTRGBR : 1;
			unsigned long CSGTRGBF : 1;
			unsigned long CSGTRGCR : 1;
			unsigned long CSGTRGCF : 1;
			unsigned long CSGTRGDR : 1;
			unsigned long CSGTRGDF : 1;
			unsigned long CSCARBL : 1;
			unsigned long CSCARBH : 1;
			unsigned long CSCAFBL : 1;
			unsigned long CSCAFBH : 1;
			unsigned long CSCBRAL : 1;
			unsigned long CSCBRAH : 1;
			unsigned long CSCBFAL : 1;
			unsigned long CSCBFAH : 1;
			unsigned long CSELCA : 1;
			unsigned long CSELCB : 1;
			unsigned long CSELCC : 1;
			unsigned long CSELCD : 1;
			unsigned long CSELCE : 1;
			unsigned long CSELCF : 1;
			unsigned long CSELCG : 1;
			unsigned long CSELCH : 1;
			unsigned long CSCMSC : 3;
			unsigned long CP1CCE : 1;
			unsigned long  : 3;
			unsigned long CCLR : 1;
#else
			unsigned long CCLR : 1;
			unsigned long  : 3;
			unsigned long CP1CCE : 1;
			unsigned long CSCMSC : 3;
			unsigned long CSELCH : 1;
			unsigned long CSELCG : 1;
			unsigned long CSELCF : 1;
			unsigned long CSELCE : 1;
			unsigned long CSELCD : 1;
			unsigned long CSELCC : 1;
			unsigned long CSELCB : 1;
			unsigned long CSELCA : 1;
			unsigned long CSCBFAH : 1;
			unsigned long CSCBFAL : 1;
			unsigned long CSCBRAH : 1;
			unsigned long CSCBRAL : 1;
			unsigned long CSCAFBH : 1;
			unsigned long CSCAFBL : 1;
			unsigned long CSCARBH : 1;
			unsigned long CSCARBL : 1;
			unsigned long CSGTRGDF : 1;
			unsigned long CSGTRGDR : 1;
			unsigned long CSGTRGCF : 1;
			unsigned long CSGTRGCR : 1;
			unsigned long CSGTRGBF : 1;
			unsigned long CSGTRGBR : 1;
			unsigned long CSGTRGAF : 1;
			unsigned long CSGTRGAR : 1;
#endif
	} BIT;
	} GTCSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long USGTRGAR : 1;
			unsigned long USGTRGAF : 1;
			unsigned long USGTRGBR : 1;
			unsigned long USGTRGBF : 1;
			unsigned long USGTRGCR : 1;
			unsigned long USGTRGCF : 1;
			unsigned long USGTRGDR : 1;
			unsigned long USGTRGDF : 1;
			unsigned long USCARBL : 1;
			unsigned long USCARBH : 1;
			unsigned long USCAFBL : 1;
			unsigned long USCAFBH : 1;
			unsigned long USCBRAL : 1;
			unsigned long USCBRAH : 1;
			unsigned long USCBFAL : 1;
			unsigned long USCBFAH : 1;
			unsigned long USELCA : 1;
			unsigned long USELCB : 1;
			unsigned long USELCC : 1;
			unsigned long USELCD : 1;
			unsigned long USELCE : 1;
			unsigned long USELCF : 1;
			unsigned long USELCG : 1;
			unsigned long USELCH : 1;
			unsigned long USILVL : 4;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long USILVL : 4;
			unsigned long USELCH : 1;
			unsigned long USELCG : 1;
			unsigned long USELCF : 1;
			unsigned long USELCE : 1;
			unsigned long USELCD : 1;
			unsigned long USELCC : 1;
			unsigned long USELCB : 1;
			unsigned long USELCA : 1;
			unsigned long USCBFAH : 1;
			unsigned long USCBFAL : 1;
			unsigned long USCBRAH : 1;
			unsigned long USCBRAL : 1;
			unsigned long USCAFBH : 1;
			unsigned long USCAFBL : 1;
			unsigned long USCARBH : 1;
			unsigned long USCARBL : 1;
			unsigned long USGTRGDF : 1;
			unsigned long USGTRGDR : 1;
			unsigned long USGTRGCF : 1;
			unsigned long USGTRGCR : 1;
			unsigned long USGTRGBF : 1;
			unsigned long USGTRGBR : 1;
			unsigned long USGTRGAF : 1;
			unsigned long USGTRGAR : 1;
#endif
	} BIT;
	} GTUPSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DSGTRGAR : 1;
			unsigned long DSGTRGAF : 1;
			unsigned long DSGTRGBR : 1;
			unsigned long DSGTRGBF : 1;
			unsigned long DSGTRGCR : 1;
			unsigned long DSGTRGCF : 1;
			unsigned long DSGTRGDR : 1;
			unsigned long DSGTRGDF : 1;
			unsigned long DSCARBL : 1;
			unsigned long DSCARBH : 1;
			unsigned long DSCAFBL : 1;
			unsigned long DSCAFBH : 1;
			unsigned long DSCBRAL : 1;
			unsigned long DSCBRAH : 1;
			unsigned long DSCBFAL : 1;
			unsigned long DSCBFAH : 1;
			unsigned long DSELCA : 1;
			unsigned long DSELCB : 1;
			unsigned long DSELCC : 1;
			unsigned long DSELCD : 1;
			unsigned long DSELCE : 1;
			unsigned long DSELCF : 1;
			unsigned long DSELCG : 1;
			unsigned long DSELCH : 1;
			unsigned long DSILVL : 4;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long DSILVL : 4;
			unsigned long DSELCH : 1;
			unsigned long DSELCG : 1;
			unsigned long DSELCF : 1;
			unsigned long DSELCE : 1;
			unsigned long DSELCD : 1;
			unsigned long DSELCC : 1;
			unsigned long DSELCB : 1;
			unsigned long DSELCA : 1;
			unsigned long DSCBFAH : 1;
			unsigned long DSCBFAL : 1;
			unsigned long DSCBRAH : 1;
			unsigned long DSCBRAL : 1;
			unsigned long DSCAFBH : 1;
			unsigned long DSCAFBL : 1;
			unsigned long DSCARBH : 1;
			unsigned long DSCARBL : 1;
			unsigned long DSGTRGDF : 1;
			unsigned long DSGTRGDR : 1;
			unsigned long DSGTRGCF : 1;
			unsigned long DSGTRGCR : 1;
			unsigned long DSGTRGBF : 1;
			unsigned long DSGTRGBR : 1;
			unsigned long DSGTRGAF : 1;
			unsigned long DSGTRGAR : 1;
#endif
	} BIT;
	} GTDNSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ASGTRGAR : 1;
			unsigned long ASGTRGAF : 1;
			unsigned long ASGTRGBR : 1;
			unsigned long ASGTRGBF : 1;
			unsigned long ASGTRGCR : 1;
			unsigned long ASGTRGCF : 1;
			unsigned long ASGTRGDR : 1;
			unsigned long ASGTRGDF : 1;
			unsigned long ASCARBL : 1;
			unsigned long ASCARBH : 1;
			unsigned long ASCAFBL : 1;
			unsigned long ASCAFBH : 1;
			unsigned long ASCBRAL : 1;
			unsigned long ASCBRAH : 1;
			unsigned long ASCBFAL : 1;
			unsigned long ASCBFAH : 1;
			unsigned long ASELCA : 1;
			unsigned long ASELCB : 1;
			unsigned long ASELCC : 1;
			unsigned long ASELCD : 1;
			unsigned long ASELCE : 1;
			unsigned long ASELCF : 1;
			unsigned long ASELCG : 1;
			unsigned long ASELCH : 1;
			unsigned long ASOC : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long ASOC : 1;
			unsigned long ASELCH : 1;
			unsigned long ASELCG : 1;
			unsigned long ASELCF : 1;
			unsigned long ASELCE : 1;
			unsigned long ASELCD : 1;
			unsigned long ASELCC : 1;
			unsigned long ASELCB : 1;
			unsigned long ASELCA : 1;
			unsigned long ASCBFAH : 1;
			unsigned long ASCBFAL : 1;
			unsigned long ASCBRAH : 1;
			unsigned long ASCBRAL : 1;
			unsigned long ASCAFBH : 1;
			unsigned long ASCAFBL : 1;
			unsigned long ASCARBH : 1;
			unsigned long ASCARBL : 1;
			unsigned long ASGTRGDF : 1;
			unsigned long ASGTRGDR : 1;
			unsigned long ASGTRGCF : 1;
			unsigned long ASGTRGCR : 1;
			unsigned long ASGTRGBF : 1;
			unsigned long ASGTRGBR : 1;
			unsigned long ASGTRGAF : 1;
			unsigned long ASGTRGAR : 1;
#endif
	} BIT;
	} GTICASR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BSGTRGAR : 1;
			unsigned long BSGTRGAF : 1;
			unsigned long BSGTRGBR : 1;
			unsigned long BSGTRGBF : 1;
			unsigned long BSGTRGCR : 1;
			unsigned long BSGTRGCF : 1;
			unsigned long BSGTRGDR : 1;
			unsigned long BSGTRGDF : 1;
			unsigned long BSCARBL : 1;
			unsigned long BSCARBH : 1;
			unsigned long BSCAFBL : 1;
			unsigned long BSCAFBH : 1;
			unsigned long BSCBRAL : 1;
			unsigned long BSCBRAH : 1;
			unsigned long BSCBFAL : 1;
			unsigned long BSCBFAH : 1;
			unsigned long BSELCA : 1;
			unsigned long BSELCB : 1;
			unsigned long BSELCC : 1;
			unsigned long BSELCD : 1;
			unsigned long BSELCE : 1;
			unsigned long BSELCF : 1;
			unsigned long BSELCG : 1;
			unsigned long BSELCH : 1;
			unsigned long BSOC : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long BSOC : 1;
			unsigned long BSELCH : 1;
			unsigned long BSELCG : 1;
			unsigned long BSELCF : 1;
			unsigned long BSELCE : 1;
			unsigned long BSELCD : 1;
			unsigned long BSELCC : 1;
			unsigned long BSELCB : 1;
			unsigned long BSELCA : 1;
			unsigned long BSCBFAH : 1;
			unsigned long BSCBFAL : 1;
			unsigned long BSCBRAH : 1;
			unsigned long BSCBRAL : 1;
			unsigned long BSCAFBH : 1;
			unsigned long BSCAFBL : 1;
			unsigned long BSCARBH : 1;
			unsigned long BSCARBL : 1;
			unsigned long BSGTRGDF : 1;
			unsigned long BSGTRGDR : 1;
			unsigned long BSGTRGCF : 1;
			unsigned long BSGTRGCR : 1;
			unsigned long BSGTRGBF : 1;
			unsigned long BSGTRGBR : 1;
			unsigned long BSGTRGAF : 1;
			unsigned long BSGTRGAR : 1;
#endif
	} BIT;
	} GTICBSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CST : 1;
			unsigned long  : 7;
			unsigned long ICDS : 1;
			unsigned long SCGTIOC : 1;
			unsigned long SSCGRP : 2;
			unsigned long  : 3;
			unsigned long SSCEN : 1;
			unsigned long MD : 4;
			unsigned long  : 3;
			unsigned long TPCS : 4;
			unsigned long CKEG : 2;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long CKEG : 2;
			unsigned long TPCS : 4;
			unsigned long  : 3;
			unsigned long MD : 4;
			unsigned long SSCEN : 1;
			unsigned long  : 3;
			unsigned long SSCGRP : 2;
			unsigned long SCGTIOC : 1;
			unsigned long ICDS : 1;
			unsigned long  : 7;
			unsigned long CST : 1;
#endif
	} BIT;
	} GTCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long UD : 1;
			unsigned long UDF : 1;
			unsigned long  : 14;
			unsigned long OADTY : 2;
			unsigned long OADTYF : 1;
			unsigned long OADTYR : 1;
			unsigned long  : 4;
			unsigned long OBDTY : 2;
			unsigned long OBDTYF : 1;
			unsigned long OBDTYR : 1;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long OBDTYR : 1;
			unsigned long OBDTYF : 1;
			unsigned long OBDTY : 2;
			unsigned long  : 4;
			unsigned long OADTYR : 1;
			unsigned long OADTYF : 1;
			unsigned long OADTY : 2;
			unsigned long  : 14;
			unsigned long UDF : 1;
			unsigned long UD : 1;
#endif
	} BIT;
	} GTUDDTYC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GTIOA : 5;
			unsigned long CPSCIR : 1;
			unsigned long OADFLT : 1;
			unsigned long OAHLD : 1;
			unsigned long OAE : 1;
			unsigned long OADF : 2;
			unsigned long OAEOCD : 1;
			unsigned long PSYE : 1;
			unsigned long NFAEN : 1;
			unsigned long NFCSA : 2;
			unsigned long GTIOB : 5;
			unsigned long  : 1;
			unsigned long OBDFLT : 1;
			unsigned long OBHLD : 1;
			unsigned long OBE : 1;
			unsigned long OBDF : 2;
			unsigned long OBEOCD : 1;
			unsigned long  : 1;
			unsigned long NFBEN : 1;
			unsigned long NFCSB : 2;
#else
			unsigned long NFCSB : 2;
			unsigned long NFBEN : 1;
			unsigned long  : 1;
			unsigned long OBEOCD : 1;
			unsigned long OBDF : 2;
			unsigned long OBE : 1;
			unsigned long OBHLD : 1;
			unsigned long OBDFLT : 1;
			unsigned long  : 1;
			unsigned long GTIOB : 5;
			unsigned long NFCSA : 2;
			unsigned long NFAEN : 1;
			unsigned long PSYE : 1;
			unsigned long OAEOCD : 1;
			unsigned long OADF : 2;
			unsigned long OAE : 1;
			unsigned long OAHLD : 1;
			unsigned long OADFLT : 1;
			unsigned long CPSCIR : 1;
			unsigned long GTIOA : 5;
#endif
	} BIT;
	} GTIOR;
	union {
		unsigned long LONG;
		struct {
			
